NUMBER_CLARIFICATION = {
    2: 'тысяч',
    3: 'миллион',
    4: 'миллиард',
    5: 'триллион',
    6: 'квадриллион',
    7: 'квинтиллион',
    8: 'секстиллион',
    9: 'септиллион',
    10: 'октиллион',
    11: 'нониллион',
    12: 'дециллион',
    13: 'ундециллион',
    14: 'додециллион',
    15: 'тредециллион',
    16: 'кваттуордециллион',
    17: 'квиндециллион',
    18: 'cедециллион',
    19: 'септдециллион',
    20: 'дуодевигинтиллион',
    21: 'ундевигинтиллион',
    22: 'вигинтиллион',
    23: 'анвигинтиллион',
    24: 'дуовигинтиллион',
    25: 'тревигинтиллион',
    26: 'кватторвигинтиллион',
    27: 'квинвигинтиллион',
    28: 'сексвигинтиллион',
    29: 'септемвигинтиллион',
    30: 'октовигинтиллион',
    31: 'новемвигинтиллион',
    32: 'тригинтиллион',
    33: 'антригинтиллион',
    34: 'гугол'
}


NUMBER_DICTS = {
    0: ['ноль'],
    1: [
        'один',
        [
            'десять', 'одиннадцать', 'двенадцать',
            'тринадцать', 'четырнадцать', 'пятнадцать',
            'шестнадцать', 'семнадцать', 'восемнадцать',
            'девятнадцать'
        ],
        'сто'
        ],
    2: ['два', 'двадцать', 'двести'],
    3: ['три', 'тридцать', 'триста'],
    4: ['четыре', 'сорок', 'четыреста'],
    5: ['пять', 'пятьдесят', 'пятьсот'],
    6: ['шесть', 'шестьдесят', 'шестьсот'],
    7: ['семь', 'семьдесят', 'семьсот'],
    8: ['восемь', 'восемьдесят', 'восемьсот'],
    9: ['девять', 'девяносто', 'девятьсот']
}
